In [2]:
import numpy as np
import pandas as pd

### idxmin() and idxmax()

In [3]:
x = pd.Series([1,3,2,8,124,4,2,1])

In [4]:
x.idxmin()

0

In [5]:
x.idxmax()

4

### ne()

In [7]:
df = pd.DataFrame()
df['X'] = [0,0,0,0,0,0,1,3,2,4,3,12,7]

In [8]:
df['X'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: X, dtype: bool

In [9]:
df['X'].ne(0).idxmax()

6

In [11]:
df.loc[df['X'].ne(0).idxmax():]

     X
6    1
7    3
8    2
9    4
10   3
11  12
12   7

### nsmallest and nlargest()

In [16]:
df = pd.DataFrame({
    'Name': [
        'Bob', 'Mark', 'Steph', 'Jess', 'Becky'
    ],
    'Points': [
        55, 98,46,77,81
    ]
})

In [17]:
df

    Name  Points
0    Bob      55
1   Mark      98
2  Steph      46
3   Jess      77
4  Becky      81

In [18]:
df.nsmallest(3,'Points')

    Name  Points
2  Steph      46
0    Bob      55
3   Jess      77

In [21]:
df.nlargest(3, 'Points')

    Name  Points
1   Mark      98
4  Becky      81
3   Jess      77

### cut()

In [24]:
pd.cut(df['Points'],5)

0    (45.948, 56.4]
1      (87.6, 98.0]
2    (45.948, 56.4]
3      (66.8, 77.2]
4      (77.2, 87.6]
Name: Points, dtype: category
Categories (5, interval[float64]): [(45.948, 56.4] < (56.4, 66.8] < (66.8, 77.2] < (77.2, 87.6] < (87.6, 98.0]]

### pivot_table()

In [44]:
df.pivot_table(index='Name', columns='Name', values='Points')

Name   Becky   Bob  Jess  Mark  Steph
Name
Becky   81.0   NaN   NaN   NaN    NaN
Bob      NaN  55.0   NaN   NaN    NaN
Jess     NaN   NaN  77.0   NaN    NaN
Mark     NaN   NaN   NaN  98.0    NaN
Steph    NaN   NaN   NaN   NaN   46.0